Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4c/include/pio/pio_sam4c32e.h
#define PIO_PB24A_TIOA3      (1u << 24) /**< \brief Tc1 signal: TIOA3 */
#define PIO_PA15B_TIOA4      (1u << 15) /**< \brief Tc1 signal: TIOA4 */
#define PIO_PA18B_TIOA5      (1u << 18) /**< \brief Tc1 signal: TIOA5 */
#define PIO_PB25A_TIOB3      (1u << 25) /**< \brief Tc1 signal: TIOB3 */
#define PIO_PA16B_TIOB4      (1u << 16) /**< \brief Tc1 signal: TIOB4 */
#define PIO_PA20B_TIOB5      (1u << 20) /**< \brief Tc1 signal: TIOB5 */
/* ========== Pio definition for TWI0 peripheral ========== */
#define PIO_PA25A_TWCK0      (1u << 25) /**< \brief Twi0 signal: TWCK0 */
#define PIO_PA24A_TWD0       (1u << 24) /**< \brief Twi0 signal: TWD0 */
/* ========== Pio definition for TWI1 peripheral ========== */
#define PIO_PB1A_TWCK1       (1u << 1)  /**< \brief Twi1 signal: TWCK1 */
#define PIO_PB0A_TWD1        (1u << 0)  /**< \brief Twi1 signal: TWD1 */
/* ========== Pio definition for UART0 peripheral ========== */
#define PIO_PB4A_URXD0       (1u << 4)  /**< \brief Uart0 signal: URXD0 */
#define PIO_PB5A_UTXD0       (1u << 5)  /**< \brief Uart0 signal: UTXD0 */
/* ========== Pio definition for UART1 peripheral ========== */
#define PIO_PC1A_URXD1       (1u << 1)  /**< \brief Uart1 signal: URXD1 */
#define PIO_PC0A_UTXD1       (1u << 0)  /**< \brief Uart1 signal: UTXD1 */
/* ========== Pio definition for USART0 peripheral ========== */
#define PIO_PA20A_CTS0       (1u << 20) /**< \brief Usart0 signal: CTS0 */
#define PIO_PA19A_RTS0       (1u << 19) /**< \brief Usart0 signal: RTS0 */
#define PIO_PB16A_RXD0       (1u << 16) /**< \brief Usart0 signal: RXD0 */
#define PIO_PB18A_SCK0       (1u << 18) /**< \brief Usart0 signal: SCK0 */
#define PIO_PB17A_TXD0       (1u << 17) /**< \brief Usart0 signal: TXD0 */
/* ========== Pio definition for USART1 peripheral ========== */
#define PIO_PA18A_CTS1       (1u << 18) /**< \brief Usart1 signal: CTS1 */
#define PIO_PA17A_RTS1       (1u << 17) /**< \brief Usart1 signal: RTS1 */
#define PIO_PA11A_RXD1       (1u << 11) /**< \brief Usart1 signal: RXD1 */
#define PIO_PA16A_SCK1       (1u << 16) /**< \brief Usart1 signal: SCK1 */
#define PIO_PA12A_TXD1       (1u << 12) /**< \brief Usart1 signal: TXD1 */
/* ========== Pio definition for USART2 peripheral ========== */
#define PIO_PA15A_CTS2       (1u << 15) /**< \brief Usart2 signal: CTS2 */
#define PIO_PA14A_RTS2       (1u << 14) /**< \brief Usart2 signal: RTS2 */
#define PIO_PA9A_RXD2        (1u << 9)  /**< \brief Usart2 signal: RXD2 */
#define PIO_PA13A_SCK2       (1u << 13) /**< \brief Usart2 signal: SCK2 */
#define PIO_PA10A_TXD2       (1u << 10) /**< \brief Usart2 signal: TXD2 */
/* ========== Pio definition for USART3 peripheral ========== */
#define PIO_PA1A_CTS3        (1u << 1)  /**< \brief Usart3 signal: CTS3 */
#define PIO_PA0A_RTS3        (1u << 0)  /**< \brief Usart3 signal: RTS3 */
#define PIO_PA3A_RXD3        (1u << 3)  /**< \brief Usart3 signal: RXD3 */
#define PIO_PA2A_SCK3        (1u << 2)  /**< \brief Usart3 signal: SCK3 */
#define PIO_PA4A_TXD3        (1u << 4)  /**< \brief Usart3 signal: TXD3 */
/* ========== Pio definition for USART4 peripheral ========== */
#define PIO_PA26A_CTS4       (1u << 26) /**< \brief Usart4 signal: CTS4 */
#define PIO_PB22A_RTS4       (1u << 22) /**< \brief Usart4 signal: RTS4 */
#define PIO_PB19A_RXD4       (1u << 19) /**< \brief Usart4 signal: RXD4 */
#define PIO_PB21A_SCK4       (1u << 21) /**< \brief Usart4 signal: SCK4 */
#define PIO_PB20A_TXD4       (1u << 20) /**< \brief Usart4 signal: TXD4 */
/* ========== Pio indexes ========== */
#define PIO_PA0_IDX          0
#define PIO_PA1_IDX          1
#define PIO_PA2_IDX          2
#define PIO_PA3_IDX          3
#define PIO_PA4_IDX          4
#define PIO_PA5_IDX          5
#define PIO_PA6_IDX          6
#define PIO_PA7_IDX          7
#define PIO_PA8_IDX          8
#define PIO_PA9_IDX          9
#define PIO_PA10_IDX         10
#define PIO_PA11_IDX         11
#define PIO_PA12_IDX         12
#define PIO_PA13_IDX         13
#define PIO_PA14_IDX         14
#define PIO_PA15_IDX         15
#define PIO_PA16_IDX         16
#define PIO_PA17_IDX         17
#define PIO_PA18_IDX         18
#define PIO_PA19_IDX         19
#define PIO_PA20_IDX         20
#define PIO_PA21_IDX         21
#define PIO_PA22_IDX         22
#define PIO_PA23_IDX         23
#define PIO_PA24_IDX         24
#define PIO_PA25_IDX         25
#define PIO_PA26_IDX         26
#define PIO_PA27_IDX         27
#define PIO_PA28_IDX         28
#define PIO_PA29_IDX         29
#define PIO_PA30_IDX         30
#define PIO_PA31_IDX         31
#define PIO_PB0_IDX          32
#define PIO_PB1_IDX          33
#define PIO_PB2_IDX          34
#define PIO_PB3_IDX          35
#define PIO_PB4_IDX          36
#define PIO_PB5_IDX          37
#define PIO_PB6_IDX          38
#define PIO_PB7_IDX          39
#define PIO_PB8_IDX          40
#define PIO_PB9_IDX          41
#define PIO_PB10_IDX         42
#define PIO_PB11_IDX         43
#define PIO_PB12_IDX         44
#define PIO_PB13_IDX         45
#define PIO_PB14_IDX         46
#define PIO_PB15_IDX         47
#define PIO_PB16_IDX         48
#define PIO_PB17_IDX         49
#define PIO_PB18_IDX         50
#define PIO_PB19_IDX         51
#define PIO_PB20_IDX         52
#define PIO_PB21_IDX         53
#define PIO_PB22_IDX         54
#define PIO_PB23_IDX         55
#define PIO_PB24_IDX         56
#define PIO_PB25_IDX         57
#define PIO_PB26_IDX         58
#define PIO_PB27_IDX         59
#define PIO_PB28_IDX         60
#define PIO_PB29_IDX         61
#define PIO_PB30_IDX         62
#define PIO_PB31_IDX         63
#define PIO_PC0_IDX          64
#define PIO_PC1_IDX          65
#define PIO_PC2_IDX          66
#define PIO_PC3_IDX          67
#define PIO_PC4_IDX          68
#define PIO_PC5_IDX          69
#define PIO_PC6_IDX          70
#define PIO_PC7_IDX          71
#define PIO_PC8_IDX          72
#define PIO_PC9_IDX          73
#define PIO_PD0_IDX          96
#define PIO_PD1_IDX          97
#define PIO_PD2_IDX          98
#define PIO_PD3_IDX          99
#define PIO_PD4_IDX          100
#define PIO_PD5_IDX          101
#define PIO_PD6_IDX          102
#define PIO_PD7_IDX          103
#define PIO_PD8_IDX          104
#define PIO_PD9_IDX          105
#define PIO_PD10_IDX         106
#define PIO_PD11_IDX         107
#define PIO_PD12_IDX         108
#define PIO_PD13_IDX         109
#define PIO_PD14_IDX         110
#define PIO_PD15_IDX         111
#define PIO_PD16_IDX         112
#define PIO_PD17_IDX         113
#define PIO_PD18_IDX         114
#define PIO_PD19_IDX         115
#define PIO_PD20_IDX         116
#define PIO_PD21_IDX         117
#define PIO_PD22_IDX         118
#define PIO_PD23_IDX         119
#define PIO_PD24_IDX         120
#define PIO_PD25_IDX         121
#define PIO_PD26_IDX         122
#define PIO_PD27_IDX         123
#define PIO_PD28_IDX         124
#define PIO_PD29_IDX         125
#define PIO_PD30_IDX         126
#define PIO_PD31_IDX         127

#endif /* _SAM4C32E_PIO_ */
